app/controllers/signups_controller.rb

  def create
    @signup = Signup.new(signup_params)
    if @signup.save
---
INSERT INTO "signups" ("created_at", "email", "firstname", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-24 14:52:57.231986"], ["email", ""], ["firstname", ""], ["updated_at", "2016-02-24 14:52:57.231986"]]